id_dic={'英国':'gb','英国2':'gb2','英国1':'gb1','美国':'am','美国3':'am3','美国2':'am2','美国1':'am1','法国':'fr','加拿大':'ca','德国':'de','德国1':'de1','德国2':'de2','德国3':'de3',
		'意大利':'it','意大利1':'it1','意大利2':'it2','俄罗斯':'ru','俄罗斯0':'ru0','俄罗斯1':'ru1','俄罗斯2':'ru2','俄罗斯3':'ru3','罗马尼亚':'ro','保加利亚':'bg','墨西哥':'mx','南斯拉夫':'yu','比利时':'be',
		'波兰':'pl','瑞士':'ch','丹麦':'dk','挪威':'no','希腊':'gr','匈牙利':'hu','芬兰':'fl','土耳其':'tr','西班牙':'es','葡萄牙':'pt','瑞典':'se','中国':'cn','中国1':'cn1','中国2':'cn2',
		'台湾':'tw','台湾1':'tw1','台湾2':'tw2','朝鲜':'nk','韩国':'rk','印度':'in','日本':'ja','日本1':'ja1','日本2':'ja2','澳大利亚':'au','荷兰':'nl'}
id_reverser_dic={value:key for key,value in id_dic.items()}
country_dic={'英国':'gb','美国':'am','法国':'fr','加拿大':'ca','德国':'de','意大利':'it','俄罗斯':'ru','罗马尼亚':'ro','保加利亚':'bg','墨西哥':'mx','南斯拉夫':'yu','比利时':'be',
			 '波兰':'pl','瑞士':'ch','丹麦':'dk','挪威':'no','希腊':'gr','匈牙利':'hu','芬兰':'fl','土耳其':'tr','西班牙':'es','葡萄牙':'pt','瑞典':'se','中国':'cn','台湾':'tw',
			 '朝鲜':'nk','韩国':'rk','印度':'in','日本':'ja','澳大利亚':'au','荷兰':'nl'}
country_reverse_dic={value:key for key,value in country_dic.items()}
battle_dic={'轴心国战役':'battle_axis','盟军战役':'battle_allies','北约战役':'battle_nato','华约战役':'battle_wto','征服':'conquest'}
battle_reverse_dic={value:key for key,value in battle_dic.items()}
commander_dic={'隆美尔': 'Rommel', '戈林': 'Goering', '古德里安': 'Guderian', '麦克阿瑟': 'MacArthur', '巴顿': 'Patton', '尼米兹': 'Nimitz', '朱可夫': 'Zhukov', '罗科索夫斯基': 'Rokossovsky',
			   '蒙哥马利': 'Montgomery', '戴高乐': 'de Gaulle', '山本': 'Yamamoto', '格拉齐亚尼': 'Graziani', '张自忠': 'Zhang', '彭德怀': 'Peng', '杂鱼1': 'common1', '杂鱼2': 'common2', '杂鱼3': 'common3'}

commander_reserve_dic={value:key for key,value in commander_dic.items()}

control_dic={'玩家':'0','电脑':'1'}
control_reverse_dic={value:key for key,value in control_dic.items()}

defeated_dic={'陆军':'land','全军':'army'}
defeated_reverse_dic={value:key for key,value in defeated_dic.items()}

color_dic={'俄罗斯1': {'r': '255', 'g': '0', 'b': '0', 'a': '90'}, '德国1': {'r': '0', 'g': '0', 'b': '0', 'a': '90'}, '德国2': {'r': '71', 'g': '87', 'b': '99', 'a': '90'},
		   '俄罗斯2': {'r': '204', 'g': '0', 'b': '32', 'a': '90'},'俄罗斯4': {'a': '90', 'b': '0', 'g': '32', 'r': '204'},'俄罗斯3': {'r': '227', 'g': '32', 'b': '0', 'a': '90'},
		   '芬兰': {'r': '146', 'g': '205', 'b': '220', 'a': '90'},'土耳其2':{'a': '90', 'b': '32', 'g': '192', 'r': '255'},'韩国':{'a': '90', 'b': '34', 'g': '45', 'r': '128'},
		   '罗马尼亚': {'r': '149', 'g': '55', 'b': '53', 'a': '90'},'美国1': {'r': '64', 'g': '199', 'b': '64', 'a': '90'}, '美国2': {'r': '64', 'g': '255', 'b': '64', 'a': '90'},
		   '美国3': {'r': '162', 'g': '255', 'b': '64', 'a': '90'},'台湾': {'a': '90', 'b': '255', 'g': '0', 'r': '0'},'挪威': {'a': '90', 'b': '226', 'g': '180', 'r': '141'},
			'俄罗斯': {'r': '255', 'g': '0', 'b': '0', 'a': '90'}, '美国': {'r': '162', 'g': '255', 'b': '64', 'a': '90'},'瑞典': {'a': '90', 'b': '84', 'g': '138', 'r': '148'},
		   '英国': {'r': '255', 'g': '255', 'b': '0', 'a': '90'}, '法国': {'r': '0', 'g': '170', 'b': '170', 'a': '90'}, '意大利': {'r': '80', 'g': '20', 'b': '200', 'a': '90'},
		   '中国': {'r': '255', 'g': '90', 'b': '90', 'a': '90'}, '中国2':{'a': '90', 'b': '32', 'g': '64', 'r': '204'},'波兰': {'r': '255', 'g': '128', 'b': '64', 'a': '90'},
		   '土耳其': {'r': '0', 'g': '128', 'b': '192', 'a': '90'},'罗马尼亚2': {'a': '90', 'b': '87', 'g': '122', 'r': '185'},'罗马尼亚3':{'a': '90', 'b': '64', 'g': '64', 'r': '204'} ,
		  '瑞典2':{'a': '90', 'b': '204', 'g': '0', 'r': '0'},'匈牙利2':{'a': '90', 'b': '90', 'g': '64', 'r': '255'},'葡萄牙':{'a': '90', 'b': '64', 'g': '128', 'r': '0'},
			'葡萄牙2':{'a': '90', 'b': '127', 'g': '127', 'r': '127'},
		  '西班牙2':{'a': '90', 'b': '64', 'g': '128', 'r': '128'},'罗马尼亚4':{'a': '90', 'b': '255', 'g': '255', 'r': '128'},'罗马尼亚5':{'a': '90', 'b': '255', 'g': '128', 'r': '128'},'匈牙利3':{'a': '90', 'b': '90', 'g': '64', 'r': '64'},
		   '西班牙': {'r': '255', 'g': '0', 'b': '128', 'a': '90'}, '印度': {'r': '0', 'g': '102', 'b': '0', 'a': '90'}, '澳大利亚': {'r': '0', 'g': '49', 'b': '146', 'a': '90'},
		   '加拿大': {'a': '90', 'b': '232', 'g': '162', 'r': '0'}, '南斯拉夫': {'r': '218', 'g': '150', 'b': '148', 'a': '90'}, '英国2':  {'a': '90', 'b': '0', 'g': '200', 'r': '200'},
		   '希腊': {'r': '83', 'g': '141', 'b': '213', 'a': '90'}, '保加利亚': {'r': '0', 'g': '0', 'b': '128', 'a': '90'}, '匈牙利': {'r': '128', 'g': '64', 'b': '90', 'a': '90'},
		   '朝鲜': {'r': '255', 'g': '153', 'b': '153', 'a': '90'}, '朝鲜2': {'a': '90', 'b': '153', 'g': '153', 'r': '128'},'比利时': {'a': '90', 'b': '0', 'g': '192', 'r': '255'},'德国3': {'a': '90', 'b': '110', 'g': '70', 'r': '45'},
		   '瑞士': {'a': '90', 'b': '0', 'g': '180', 'r': '141'},'意大利2':{'a': '90', 'b': '200', 'g': '0', 'r': '100'}, '瑞士2':{'a': '90', 'b': '154', 'g': '110', 'r': '110'},
		   '日本1': {'a': '90', 'b': '0', 'g': '128', 'r': '255'},'德国': {'a': '90', 'b': '50', 'g': '32', 'r': '9'},'台湾2':{'a': '90', 'b': '210', 'g': '0', 'r': '0'},
			'台湾1':{'a': '90', 'b': '200', 'g': '50', 'r': '0'} ,'墨西哥':{'a': '90', 'b': '169', 'g': '30', 'r': '64'} }
def color_reverse_dic(dic):
	return list(color_dic.keys())[list(color_dic.values()).index(dic)]



armydef_dic={'infantry': '步兵', 'panzer': '装甲兵', 'artillery': '炮兵', 'rocket': '火箭', 'tank': '坦克', 'heavytank': '重型坦克', 'destroyer': '驱逐舰', 'cruiser': '巡洋舰',
			 'battleship': '战列舰', 'aircraftcarrier': '航空母舰', 'carrier': '航母', 'airstrike': '空袭', 'bomber': '轰炸机', 'airborne': '空降兵', 'nuclearbomb': '核弹头',
			 'strength':'生命值','movement':'移动能力','minatk':'最小攻击力','maxatk':'最大攻击力'}
armydef_reverse_dic={value:key for key,value in armydef_dic.items()}

info_dic={'armydef':'国家属性','commanderdef':'指挥官属性'}
info_reverse_dic={value:key for key,value in info_dic.items()}

commanderdef_dic={'country':'国家', 'rank':'坦克', 'infantry':'步兵', 'airforce':'空军', 'artillery':'炮兵', 'armour':'装甲', 'navy':'海军', 'honour':'荣誉'}
commanderdef_reserve_dic={value:key for key,value in commanderdef_dic.items()}